OdError.attachPreviousError(OdError!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the Error object previous to this one in this Error stack.
\param previousError [in]  Previous Error object.

OdError.description
\details
Returns the description of this Error object.

OdError.code
\details
Returns the OdResult code of this Error object.

OdError.#ctor(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdError!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\param previousError [in]  Previous Error object.

OdError.#ctor(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\param errorMessage [in]  Error message.

OdError.#ctor(OdErrorContext*)
\param pErrorContext [in]  Pointer to the ErrorContext.

OdError.#ctor(OdResult)
\param code [in]  Error code.